kms-app/load/users.yml
# Artillery load profile for the KMS comparison harness.
#
# Backend-agnostic: it drives the same create + read flow regardless of which
# backend the server was started with (ENCRYPTION_BACKEND). Run it once per
# backend and compare the JSON outputs with `npm run report`.
#
# Design notes:
#   - The default is a SUSTAINED, fixed-rate steady-state test. Holding one
#     arrival rate gives stable p50/p95/p99 at a known offered load, which is
#     what you want when comparing backends. The commented `ramp` phase is the
#     alternative when you instead want to find the saturation knee.
#   - Keep `arrivalRate` well under your AWS KMS account limits for the
#     `aws-kms` (direct) backend, or you'll measure KMS throttling rather than
#     crypto cost. `aws-kms-envelope` with data-key caching makes far fewer KMS
#     calls and tolerates higher rates.
#   - Requests are named ("create" / "read") and metrics-by-endpoint is enabled,
#     so the write and read paths are reported separately, not blended.

config:
  target: "http://localhost:3000" # override: artillery run --target http://host load/users.yml
  processor: "./processor.js"
  plugins:
    expect: {}
    metrics-by-endpoint: {}
  # Fail the run loudly if the error rate or tail latency blows out, so a
  # throttled/erroring backend doesn't quietly produce a "fast" result.
  ensure:
    - expression: "vusers.failed == 0"
    - expression: "http.response_time.p95 < 1000"
  phases:
    # Warmup — let the pool, JIT, and data-key caches settle. Throwaway numbers.
    - name: warmup
      duration: 20
      arrivalRate: 5
    # Steady state — the measured load. One fixed rate, held long enough for
    # stable percentiles. Raise arrivalRate/duration to push harder.
    - name: steady
      duration: 120
      arrivalRate: 25
    # --- Alternative: saturation ramp. Comment out `steady` and use this to
    #     find where latency degrades. ---
    # - name: ramp
    #   duration: 120
    #   arrivalRate: 10
    #   rampTo: 200
  defaults:
    headers:
      content-type: application/json

scenarios:
  - name: create-then-read
    flow:
      - function: "genUser"
      - post:
          name: "create" # write path: encrypt + store
          url: "/api/users"
          json:
            email: "{{ email }}"
            name: "{{ name }}"
          capture:
            - json: "$.id"
              as: "userId"
          expect:
            - statusCode: 201
      - get:
          name: "read" # read path: fetch + decrypt
          url: "/api/users/{{ userId }}"
          expect:
            - statusCode: 200